---
kind: type
id: T:Autodesk.Revit.DB.SymbolGeometryId
source: html/386b1518-9376-b3bc-8751-29189af6d154.htm
---
# Autodesk.Revit.DB.SymbolGeometryId

This class is used to identify a piece of geometry managed by a symbol element.

## Syntax (C#)
```csharp
public class SymbolGeometryId : IDisposable
```

## Remarks
This class can be used to compare if two instances points to the same piece of geometry managed by a symbol element.
 The string returned by AsIdentifier can be used to achieve this.